Revit 2027 API
Generic.GenericSelfIllumFilterMap Property
 The property labeled "Filter Color" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericSelfIllumFilterMap { get; }
Public Shared ReadOnly Property GenericSelfIllumFilterMap As String
	Get
public:
static property String^ GenericSelfIllumFilterMap {
	String^ get ();
}
static member GenericSelfIllumFilterMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace